 [
      {
        "title": "Collaborative Study Groups",
        "description": "Connect with classmates and form study groups to boost your learning experience. Share ideas, notes, and resources. Collaborate in real-time and schedule group study sessions.",
        "img": "https://i.ibb.co/GRbZM2G/stock-vector-people-reading-books-together-library-students-read-textbooks-study-of-material-trainin.jpg"
      },
      {
        "title": "Interactive Discussion Forums",
        "description": "Engage in meaningful discussions and ask questions related to your assignments and subjects. Get answers from your peers and tutors. Upvote and mark the best answers.",
        "img": "https://i.ibb.co/nBT2HP1/children-group-discussing-cartoon-kids-260nw-1945014502.webp"
      },
      {
        "title": "Study Material Repository",
        "description": "Access a centralized repository of study materials, including lecture notes, textbooks, and past assignments, all in one place. Upload and organize your own study resources.",
        "img": "https://i.ibb.co/SsC2prt/360-F-54467511-n38t0-PC0p-LOk-Tn63f-Fv6k7-Esmwf-MRwf4.jpg"
      },
      {
        "title": "Task Collaboration",
        "description": "Work together on assignments and projects with your study group members. Collaboratively create, edit, and submit tasks. Set deadlines and track task progress.",
        "img": "https://i.ibb.co/CPYBnRg/download.jpg"
      },
      {
        "title": "Progress Tracking",
        "description": "Keep track of your study group's progress on assignments and projects. Monitor deadlines, milestones, and achievements. View statistics and analytics for a better overview.",
        "img": "https://i.ibb.co/drThxPj/istockphoto-1400145919-612x612.jpg"
      },
      {
        "title": "Peer Feedback and Reviews",
        "description": "Receive constructive feedback and reviews from your peers on your assignments, improving your skills and knowledge. Provide feedback to others and build a feedback history.",
        "img": "https://i.ibb.co/LCC7C1m/istockphoto-1318435586-612x612.jpg"
      }
    ]
 
  